{"data":{"site":{"siteMetadata":{"title":"Sanderfish | Bootstrapper, Developer and Product Designer","author":"Sander Visser"}},"markdownRemark":{"id":"24c6c4f4-aff7-5715-b738-f3432abb9300","excerpt":"Sometime this month last year, I quit drinking alcohol. I had no goal, no reason and no expectations. I just wanted to see what it was like. The changes that…","html":"<p><strong>Sometime this month last year, I quit drinking alcohol. I had no goal, no reason and no expectations. I just wanted to see what it was like. The changes that happened since not drinking are subtle, but they are very real.</strong></p>\n<br />\n<p>First, I have been going out less at night. I barely visit bars, pubs, clubs and concerts. Traveling played a part in this as well, especially for the concerts. Activities and events at night have ended earlier – I’m usually in bed before midnight, also on weekends.</p>\n<p>That caused me to have a much more balanced sleeping pattern. I sleep 8 hours most nights, and usually get up before 8.</p>\n<p>I used to get up late-ish (9-10am), feel tired during the day and feel unfinished at night. I’d work late to finish stuff, leaving no time for other activities.</p>\n<p>I barely work (professionally) in the evening anymore, except hobby projects. Instead, I spend a lot of time cooking, go on walks or play a boardgame.</p>\n<p>Overall I feel so much more balanced. I’m relaxed, sleep well, eat well and have time to pursue things outside of work.</p>\n<p>Now there’s one aspect that I could consider a downside of not drinking, and that’s making friends.</p>\n<p>Drinking bonds.</p>\n<p>I have made less friends the past year and I feel like it is harder to relate to people, or for people to relate with me.</p>\n<p>If most people are drinking and you’re not, sometimes people, or you, feel awkward. There can be judgement from either side, which makes it harder to bond.</p>\n<p>That has also been a reason for me to avoid some situations, activities and events.</p>\n<p>At the same time, the friendships I did make feel stronger and deeper. I’ve had meaningful conversations instead of a shared night of fun. I’ve learnt from those people by talking about topics that interest me.</p>\n<p>I don’t think one excludes the other. You can probably drink and have meaningful conversations. Probably in the opposite order though :-)</p>\n<p>I have experienced this time without alcohol largely positive and have no intention to drink any time soon.</p>\n<p>I try to not let my own preferences and decisions, on this topic and on other topics, influence my opinion on others.</p>\n<p>I think relationships come from understanding. Sharing the same values likely means you understand each other, but you can still understand each other without sharing the same values. It just takes a bit more effort and a bit less judgement.</p>","frontmatter":{"title":"Reflecting on a year without alcohol","date":"April 12, 2019"}}},"pageContext":{"slug":"/year-without-alcohol/","previous":{"fields":{"slug":"/year-without-alcohol/"},"frontmatter":{"title":"Reflecting on a year without alcohol"}},"next":null}}