{"data":{"site":{"siteMetadata":{"title":"Sanderfish | Bootstrapper, Developer and Product Designer","author":"Sander Visser"}},"markdownRemark":{"id":"24c6c4f4-aff7-5715-b738-f3432abb9300","excerpt":"Sometime this month last year, I quit drinking alcohol. I had no goal, no reason and no expectations. I just wanted to see what it was like. The changes that…","html":"<p><strong>Sometime this month last year, I quit drinking alcohol. I had no goal, no reason and no expectations. I just wanted to see what it was like. The changes that happened since not drinking are subtle, but they are very real.</strong></p>\n<br />\n<p>First, I go out less at night. I barely visit bars, pubs, clubs and concerts. Traveling plays a part in this as well, especially for the concerts. Activities and events at night usually end earlier, or at least I end up leaving earlier than I would in the past. I’m usually in bed before midnight, also on weekends. This causes me to have a much more balanced sleeping pattern. I sleep 8 hours most nights, and usually get up before 8.</p>\n<p>I used to get up late-ish (9-10am), feel tired during the day and feel unfinished at night. I would work late to finish work I didn’t get done because I got up late and was tired, leaving no time for other activities.</p>\n<p>I barely work (professionally) in the evening anymore, except hobby projects. I usually feel satisfied with what I’ve done that day around 5-7pm. I now spend that time for example on cooking, walking or playing boardgames.</p>\n<p>Overall I feel so much more balanced. I’m relaxed, sleep well, eat well and have time to pursue things outside of work. I experience less ups and downs and moodshifts.</p>\n<p>Now there’s one aspect that I could consider a downside of not drinking, and that’s making friends.</p>\n<br />\n<h3>Drinking bonds.</h3>\n<br />\n<p>I have made less friends the past year and I feel like it is harder to relate to people, or for people to relate with me.</p>\n<p>If most people are drinking and you’re not, sometimes people, or you, feel awkward. There can be judgement from either side, which makes it harder to bond. That has also been a reason for me to avoid some situations, activities and events.</p>\n<p>At the same time, the friendships I did make feel stronger and deeper. I’ve had meaningful conversations instead of a shared night of fun. I’ve learnt from people by talking about topics that are valuable to me.</p>\n<p>I don’t think one has to exclude the other. You can probably have meaningful conversations and drink. I try to not let my own preferences and decisions, on this topic and on other topics, influence my opinion on others. I think relationships come from understanding. Sharing the same values likely means you understand each other, but you can still understand each other without sharing the same values. It just takes a bit more effort and a bit less judgement.</p>","frontmatter":{"title":"Reflecting on a year without alcohol","date":"April 12, 2019"}}},"pageContext":{"slug":"/year-without-alcohol/","previous":{"fields":{"slug":"/year-without-alcohol/"},"frontmatter":{"title":"Reflecting on a year without alcohol"}},"next":null}}